In [3]:
import pandas as pd

In [ ]:
data ~{
    '2015':[23456,45686,15325,15623],
    '2010':[12345,23456,34567,45678],
    '지역':['수도권','경상권','수도권','경상권']
}

index=['서울','부산','인천','대구']

In [4]:
data=[
    [22,60.1,170.5,'남','서울'],
    [23,70.1,171.5,'여','서울'],
    [24,80.1,172.5,'남','경기'],
    [25,90.1,173.5,'여','광주']
]

index=['홍길동','이몽룡','성춘향','변학도']
columns=['나이','몸무게','키','성별','주소']

df3=pd.DataFrame(data, index=index,columns=columns)
df3

     나이   몸무게      키 성별  주소
홍길동  22  60.1  170.5  남  서울
이몽룡  23  70.1  171.5  여  서울
성춘향  24  80.1  172.5  남  경기
변학도  25  90.1  173.5  여  광주

In [7]:
df3['국적']='대한민국'
df3

     나이   몸무게      키 성별  주소    국적
홍길동  22  60.1  170.5  남  서울  대한민국
이몽룡  23  70.1  171.5  여  서울  대한민국
성춘향  24  80.1  172.5  남  경기  대한민국
변학도  25  90.1  173.5  여  광주  대한민국

In [8]:
toeic=[450,780,600,900]
df3['toeic']=toeic
df3

     나이   몸무게      키 성별  주소    국적  toeic
홍길동  22  60.1  170.5  남  서울  대한민국    450
이몽룡  23  70.1  171.5  여  서울  대한민국    780
성춘향  24  80.1  172.5  남  경기  대한민국    600
변학도  25  90.1  173.5  여  광주  대한민국    900

In [16]:
type(df3['키'])

pandas.core.series.Series

In [18]:
df3['직업']=['학생','회사원','간호사','축구선수']
df3

     나이   몸무게      키 성별  주소    국적  toeic    직업
홍길동  22  60.1  170.5  남  서울  대한민국    450    학생
이몽룡  23  70.1  171.5  여  서울  대한민국    780   회사원
성춘향  24  80.1  172.5  남  경기  대한민국    600   간호사
변학도  25  90.1  173.5  여  광주  대한민국    900  축구선수

In [51]:
df3['BMI']=round(df3['몸무게'] / pou(df3['키'], 2)*10000,2)

NameError: name 'pou' is not defined

In [27]:
df3.loc['박길동']=[30,70,170.4,'남','부산','대한민국',800,'회사원']
df3

     나이   몸무게      키 성별  주소    국적  toeic    직업
홍길동  22  60.1  170.5  남  서울  대한민국    450    학생
이몽룡  23  70.1  171.5  여  서울  대한민국    780   회사원
성춘향  24  80.1  172.5  남  경기  대한민국    600   간호사
변학도  25  90.1  173.5  여  광주  대한민국    900  축구선수
박길동  30  70.0  170.4  남  부산  대한민국    800   회사원

In [28]:
df5=df3.drop('변학도')
df5

     나이   몸무게      키 성별  주소    국적  toeic   직업
홍길동  22  60.1  170.5  남  서울  대한민국    450   학생
이몽룡  23  70.1  171.5  여  서울  대한민국    780  회사원
성춘향  24  80.1  172.5  남  경기  대한민국    600  간호사
박길동  30  70.0  170.4  남  부산  대한민국    800  회사원

In [39]:
df5=df5.drop(['나이'], axis=1)
df5

      몸무게      키 성별  주소    국적  toeic   직업
홍길동  60.1  170.5  남  서울  대한민국    450   학생
이몽룡  70.1  171.5  여  서울  대한민국    780  회사원
성춘향  80.1  172.5  남  경기  대한민국    600  간호사
박길동  70.0  170.4  남  부산  대한민국    800  회사원

In [40]:
df3.values

array([[22, 60.1, 170.5, '남', '서울', '대한민국', 450, '학생'],
       [23, 70.1, 171.5, '여', '서울', '대한민국', 780, '회사원'],
       [24, 80.1, 172.5, '남', '경기', '대한민국', 600, '간호사'],
       [25, 90.1, 173.5, '여', '광주', '대한민국', 900, '축구선수'],
       [30, 70.0, 170.4, '남', '부산', '대한민국', 800, '회사원']], dtype=object)

In [41]:
df3.keys

<bound method NDFrame.keys of      나이   몸무게      키 성별  주소    국적  toeic    직업
홍길동  22  60.1  170.5  남  서울  대한민국    450    학생
이몽룡  23  70.1  171.5  여  서울  대한민국    780   회사원
성춘향  24  80.1  172.5  남  경기  대한민국    600   간호사
변학도  25  90.1  173.5  여  광주  대한민국    900  축구선수
박길동  30  70.0  170.4  남  부산  대한민국    800   회사원>

In [42]:
df3.columns

Index(['나이', '몸무게', '키', '성별', '주소', '국적', 'toeic', '직업'], dtype='object')

In [47]:
df3.items

<bound method DataFrame.items of      나이   몸무게      키 성별  주소    국적  toeic    직업
홍길동  22  60.1  170.5  남  서울  대한민국    450    학생
이몽룡  23  70.1  171.5  여  서울  대한민국    780   회사원
성춘향  24  80.1  172.5  남  경기  대한민국    600   간호사
변학도  25  90.1  173.5  여  광주  대한민국    900  축구선수
박길동  30  70.0  170.4  남  부산  대한민국    800   회사원>

In [48]:
df3.index

Index(['홍길동', '이몽룡', '성춘향', '변학도', '박길동'], dtype='object')

df3.info()

In [49]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, 홍길동 to 박길동
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   나이      5 non-null      int64
 1   몸무게     5 non-null      float64
 2   키       5 non-null      float64
 3   성별      5 non-null      object
 4   주소      5 non-null      object
 5   국적      5 non-null      object
 6   toeic   5 non-null      int64
 7   직업      5 non-null      object
dtypes: float64(2), int64(2), object(4)
memory usage: 520.0+ bytes

In [53]:
data=[
    [76,77,78,79,80],
    [81,82,83,84,85],
    [86,87,88,89,90],
    [91,92,93,94,95],
    [96,97,98,99,100]
]

index=['홍길동','이몽룡','성춘향','변학도','강길동']
columns=['국어','영어','수학','음악','체육']

df6=pd.DataFrame(data, index=index,columns=columns)
df6

     국어  영어  수학  음악   체육
홍길동  76  77  78  79   80
이몽룡  81  82  83  84   85
성춘향  86  87  88  89   90
변학도  91  92  93  94   95
강길동  96  97  98  99  100

In [55]:
df6['영어']=[95,87,75,80,88]
df6

     국어  영어  수학  음악   체육
홍길동  76  95  78  79   80
이몽룡  81  87  83  84   85
성춘향  86  75  88  89   90
변학도  91  80  93  94   95
강길동  96  88  98  99  100

In [58]:
df7=df6.drop(['음악','체육'], axis=1)
df7

     국어  영어  수학
홍길동  76  95  78
이몽룡  81  87  83
성춘향  86  75  88
변학도  91  80  93
강길동  96  88  98

In [62]:
df7['총점']=df7['국어']+df7['영어']+df7['수학']
df7['평균']=round((df7['국어']+df7['영어']+df7['수학'])/3,2)
df7

     국어  영어  수학   총점     평균
홍길동  76  95  78  249  83.00
이몽룡  81  87  83  251  83.67
성춘향  86  75  88  249  83.00
변학도  91  80  93  264  88.00
강길동  96  88  98  282  94.00

In [65]:
df7=df7.drop('성춘향')
df7

     국어  영어  수학   총점     평균
홍길동  76  95  78  249  83.00
이몽룡  81  87  83  251  83.67
변학도  91  80  93  264  88.00
강길동  96  88  98  282  94.00

In [66]:
df7.loc['김길동']=[30,40,50,120,40]
df7.loc['유길동']=[30,40,50,120,40]
df7.loc['진길동']=[30,40,50,120,40]
df7

ValueError: cannot set a row with mismatched columns